<a href="https://colab.research.google.com/github/ezehlivinus/hamoye/blob/main/quiz1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# get the data 
data_url = 'https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv'

dataset = pd.read_csv(data_url)

In [ ]:
# checking summary
dataset.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [ ]:
# question 3
groupedByFuelTypeCodde = dataset.groupby('fuel_type_code_pudl')

In [ ]:
cost_mean = groupedByFuelTypeCodde[['fuel_cost_per_unit_burned']].mean()

In [ ]:
cost_mean[cost_mean == cost_mean.min()]

                     fuel_cost_per_unit_burned
fuel_type_code_pudl
coal                                       NaN
gas                                  13.659397
nuclear                                    NaN
oil                                        NaN
other                                      NaN
waste                                      NaN

In [ ]:
# question 4
Fuel_mmbtu_per_unit = dataset.groupby('fuel_mmbtu_per_unit')

In [ ]:
Fuel_mmbtu_per_unit['fuel_mmbtu_per_unit'].describe()

                     count        mean  ...         75%         max
fuel_mmbtu_per_unit                     ...
0.000001              20.0    0.000001  ...    0.000001    0.000001
0.000005               3.0    0.000005  ...    0.000005    0.000005
0.000006              58.0    0.000006  ...    0.000006    0.000006
0.000007              18.0    0.000007  ...    0.000007    0.000007
0.000009               6.0    0.000009  ...    0.000009    0.000009
...                    ...         ...  ...         ...         ...
124.855946             1.0  124.855946  ...  124.855946  124.855946
124.860000             1.0  124.860000  ...  124.860000  124.860000
124.879004             1.0  124.879004  ...  124.879004  124.879004
125.120000             1.0  125.120000  ...  125.120000  125.120000
341.260000             1.0  341.260000  ...  341.260000  341.260000

[11227 rows x 8 columns]